# Assignment 3

# For Salary Dataset

In [33]:
import pandas as pd
import numpy as np

In [34]:
df = pd.read_csv("Salary_Data.csv")
df.head()

,Age,Gender,Education Level,Job Title,Years of Experience,Salary
0,32.0,Male,Bachelor's,Software Engineer,5.0,90000.0
1,28.0,Female,Master's,Data Analyst,3.0,65000.0
2,45.0,Male,PhD,Senior Manager,15.0,150000.0
3,36.0,Female,Bachelor's,Sales Associate,7.0,60000.0
4,52.0,Male,Master's,Director,20.0,200000.0

In [35]:
df2 = df[["Age","Gender","Salary"]]
df2.head()

    Age  Gender    Salary
0  32.0    Male   90000.0
1  28.0  Female   65000.0
2  45.0    Male  150000.0
3  36.0  Female   60000.0
4  52.0    Male  200000.0

In [36]:
df2.shape

(6704, 3)

In [37]:
df2.isna().sum()

Age       2
Gender    2
Salary    5
dtype: int64

In [38]:
df2.dropna(inplace=True)

C:\Users\PRIYA\AppData\Local\Temp\ipykernel_3924\1761232742.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2.dropna(inplace=True)

In [39]:
# if enpty categrical mode 
# df['Math_Score'].fillna(df['MAth_score'].median(), inplace =True)
# data['Age'] = data['Age'].fillna(np.mean(data['Age']))

In [40]:
df2.isna().sum()

Age       0
Gender    0
Salary    0
dtype: int64

In [41]:
import pandas as pd

# Define the age_group function
def age_group(age):
    if age <= 39:
        return "Young Adult"
    elif age <= 59:
        return "Middle Age Adult"
    else:
        return "Old Adult"

# Assuming df2 is your DataFrame containing the "Age" column
# Apply the age_group function to create a new column "Age Group"
df2["Age Group"] = df2["Age"].apply(age_group)

# Display the first few rows of the DataFrame to verify the new column
print(df2.head())

    Age  Gender    Salary         Age Group
0  32.0    Male   90000.0       Young Adult
1  28.0  Female   65000.0       Young Adult
2  45.0    Male  150000.0  Middle Age Adult
3  36.0  Female   60000.0       Young Adult
4  52.0    Male  200000.0  Middle Age Adult

C:\Users\PRIYA\AppData\Local\Temp\ipykernel_3924\1226376160.py:14: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df2["Age Group"] = df2["Age"].apply(age_group)

In [42]:
df2["Age Group"].value_counts()

Age Group
Young Adult         5259
Middle Age Adult    1428
Old Adult             12
Name: count, dtype: int64

In [43]:
df2.groupby(["Age Group"])["Salary"].mean()

Age Group
Middle Age Adult    171445.844538
Old Adult           194221.833333
Young Adult          99908.729606
Name: Salary, dtype: float64

In [44]:
df2.groupby(["Age Group"])["Salary"].median()

Age Group
Middle Age Adult    180000.0
Old Adult           200000.0
Young Adult          95000.0
Name: Salary, dtype: float64

In [45]:
df2.groupby(["Age Group"])["Salary"].agg(pd.Series.mode)

Age Group
Middle Age Adult    190000.0
Old Adult           200000.0
Young Adult          55000.0
Name: Salary, dtype: float64

In [46]:
min = df2.groupby(["Age Group"])["Salary"].min()
min

Age Group
Middle Age Adult     60000.0
Old Adult           179180.0
Young Adult            350.0
Name: Salary, dtype: float64

In [47]:
max = df2.groupby(["Age Group"])["Salary"].max()
max

Age Group
Middle Age Adult    250000.0
Old Adult           200000.0
Young Adult         210000.0
Name: Salary, dtype: float64

In [48]:
range = max - min
print("Range\n",range)

mid_range = range/2
print("\nMid-Range\n",mid_range)

Range
 Age Group
Middle Age Adult    190000.0
Old Adult            20820.0
Young Adult         209650.0
Name: Salary, dtype: float64

Mid-Range
 Age Group
Middle Age Adult     95000.0
Old Adult            10410.0
Young Adult         104825.0
Name: Salary, dtype: float64

In [49]:
standard_dev = df2.groupby(["Age Group"])["Salary"].std()
standard_dev

Age Group
Middle Age Adult    27346.224381
Old Adult            8251.159046
Young Adult         47319.123769
Name: Salary, dtype: float64

In [50]:
# sd = root(xi-U)^2/N

In [51]:
variance = np.square(standard_dev)
variance

Age Group
Middle Age Adult    7.478160e+08
Old Adult           6.808163e+07
Young Adult         2.239099e+09
Name: Salary, dtype: float64

In [52]:
# variance = (xi -u)/N

# For Iris Flower Dataset

In [53]:
df3  = pd.read_csv("Iris.csv")
df3.head()

   Id  SepalLengthCm  SepalWidthCm  PetalLengthCm  PetalWidthCm      Species
0   1            5.1           3.5            1.4           0.2  Iris-setosa
1   2            4.9           3.0            1.4           0.2  Iris-setosa
2   3            4.7           3.2            1.3           0.2  Iris-setosa
3   4            4.6           3.1            1.5           0.2  Iris-setosa
4   5            5.0           3.6            1.4           0.2  Iris-setosa

In [54]:
df3.isna().sum()

Id               0
SepalLengthCm    0
SepalWidthCm     0
PetalLengthCm    0
PetalWidthCm     0
Species          0
dtype: int64

In [55]:
# if enpty categrical mode 
# df['Math_Score'].fillna(df['MAth_score'].median(), inplace =True)
# data['Age'] = data['Age'].fillna(np.mean(data['Age']))

In [56]:
df3.shape

(150, 6)

In [57]:
df3["Species"].value_counts()

Species
Iris-setosa        50
Iris-versicolor    50
Iris-virginica     50
Name: count, dtype: int64

In [58]:
df3.groupby(df3["Species"])["SepalLengthCm"].mean()

Species
Iris-setosa        5.006
Iris-versicolor    5.936
Iris-virginica     6.588
Name: SepalLengthCm, dtype: float64

In [59]:
df3.groupby(df3["Species"])["SepalLengthCm"].median()

Species
Iris-setosa        5.0
Iris-versicolor    5.9
Iris-virginica     6.5
Name: SepalLengthCm, dtype: float64

In [60]:
min2 = df3.groupby(df3["Species"])["SepalLengthCm"].min()
min2

Species
Iris-setosa        4.3
Iris-versicolor    4.9
Iris-virginica     4.9
Name: SepalLengthCm, dtype: float64

In [61]:
max2 = df3.groupby(df3["Species"])["SepalLengthCm"].max()
max2

Species
Iris-setosa        5.8
Iris-versicolor    7.0
Iris-virginica     7.9
Name: SepalLengthCm, dtype: float64

In [62]:
range2 = max2 - min2
range2

Species
Iris-setosa        1.5
Iris-versicolor    2.1
Iris-virginica     3.0
Name: SepalLengthCm, dtype: float64

In [63]:
mid_range2 = range2/2
mid_range2

Species
Iris-setosa        0.75
Iris-versicolor    1.05
Iris-virginica     1.50
Name: SepalLengthCm, dtype: float64

In [64]:
df3.groupby(df3["Species"])["SepalLengthCm"].std()

Species
Iris-setosa        0.352490
Iris-versicolor    0.516171
Iris-virginica     0.635880
Name: SepalLengthCm, dtype: float64

In [65]:
variance2 = df3.groupby(df3["Species"])["SepalLengthCm"].var()
variance2

Species
Iris-setosa        0.124249
Iris-versicolor    0.266433
Iris-virginica     0.404343
Name: SepalLengthCm, dtype: float64

In [66]:
standard_dev2 = np.square(variance2)
standard_dev2

Species
Iris-setosa        0.015438
Iris-versicolor    0.070986
Iris-virginica     0.163493
Name: SepalLengthCm, dtype: float64